app/Views/admin/templates/header.php

                        <div><?=session()->get('fullname')?></div>
                        <?php
                        $roleModel = new \App\Models\roleModel();
                        $role = $roleModel->where('role_id', session()->get('role'))->first();
---
SELECT *
FROM `roles`
WHERE `role_id` = '2'
 LIMIT 1