app/Views/admin/templates/header.php

                            <div class="list-group list-group-flush list-group-hoverable">
                                <?php
                                $db = \Config\Database::connect();
                                $query = $db->table('notifications a')
                                        ->select('a.announcement_id,b.title,b.details')
                                        ->join('announcement b','b.announcement_id=a.announcement_id','LEFT')
                                        ->where('a.account_id',session()->get('loggedAdmin'))->where('a.status',0)
                                        ->get()->getResult();
---
SELECT `a`.`announcement_id`, `b`.`title`, `b`.`details`
FROM `notifications` `a`
LEFT JOIN `announcement` `b` ON `b`.`announcement_id`=`a`.`announcement_id`
WHERE `a`.`account_id` = '1'
AND `a`.`status` = 0

                        <div><?=session()->get('fullname')?></div>
                        <?php
                        $roleModel = new \App\Models\roleModel();
                        $role = $roleModel->where('role_id', session()->get('role'))->first();
---
SELECT *
FROM `roles`
WHERE `role_id` = '2'
 LIMIT 1