app/Views/admin/templates/sidebar.php

SELECT *
FROM `roles`
WHERE `role_id` = '2'
 LIMIT 1
---
<?php
$roleModel = new \App\Models\roleModel();
$role = $roleModel->where('role_id', session()->get('role'))->first();