app/Views/admin/schedules/all-schedules.php

    <?php $eventData = array();?>
    <?php
    $scheduleModel = new \App\Models\ScheduleModel();
    $schedules = $scheduleModel->where('day', 'Saturday')->findAll();
    // Determine dynamic date range from the records
    $minDate = $scheduleModel->selectMin('from_date')->first()['from_date'];
    $maxDate = $scheduleModel->selectMax('to_date')->first()['to_date'];
---
SELECT *
FROM `schedules`
WHERE `day` = 'Saturday'
SELECT *
FROM `schedules`
SELECT MIN(`from_date`) AS `from_date`
FROM `schedules`
 LIMIT 1
SELECT MAX(`to_date`) AS `to_date`
FROM `schedules`
 LIMIT 1