app/Controllers/Administrator.php

INSERT INTO `logs` (`account_id`, `activities`, `page`, `datetime`) VALUES ('1', 'Logged Out', 'Login page', '2025-11-27 12:05:08 am')
---
    public function logout()
    {
        //logs
        date_default_timezone_set('Asia/Manila');
        $logModel = new \App\Models\logModel();
        $data = ['account_id'=>session()->get('loggedAdmin'),
                'activities'=>'Logged Out',
                'page'=>'Login page',
                'datetime'=>date('Y-m-d h:i:s a')
                ];
        $logModel->save($data);

SELECT *
FROM `accounts`
WHERE `account_id` = '1'
 LIMIT 1
SELECT *
FROM `roles`
WHERE `role_id` = '2'
 LIMIT 1
---
    public function hasPermission($page)
    {
        $roleModel = new \App\Models\roleModel();
        $accountModel = new accountModel();
        $account = $accountModel->WHERE('account_id',session()->get('loggedAdmin'))->first();
        $role = $roleModel->WHERE('role_id',$account['role_id'])->first();

SELECT *
FROM `announcement`
ORDER BY `announcement_id` DESC
 LIMIT 5
---
    public function index()
    {
        $title = 'Overview';
        //announcement
        $announcementModel = new \App\Models\announcementModel();
        $announcement = $announcementModel->orderBy('announcement_id','DESC')->limit(5)->findAll();

SELECT COUNT(*) AS `numrows`
FROM `students`
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `is_enroll` = 1
SELECT COUNT(*) AS `numrows`
FROM `schedules`
SELECT COUNT(*) AS `numrows`
FROM `assignments`
WHERE `account_id` <> 0
SELECT `c`.`batchName`, `b`.`name`, `b`.`details`, `b`.`day`, `b`.`from_time`, `b`.`to_time`, `a`.`schedule_id`
FROM `assignments` `a`
LEFT JOIN `schedules` `b` ON `b`.`schedule_id`=`a`.`schedule_id`
LEFT JOIN `batches` `c` ON `c`.`batch_id`=`b`.`batch_id`
WHERE `a`.`account_id` = '1'
GROUP BY `a`.`assignment_id`
ORDER BY `a`.`assignment_id` DESC
 LIMIT 5
---
        $attendance = $query->getResultArray();
        //count the total cadet
        $studentModel = new studentModel();
        $total = $studentModel->countAllResults();
        //count the total enrolled cadet
        $totalEnrolled = $studentModel->where('is_enroll',1)->countAllResults();
        //total training
        $scheduleModel = new scheduleModel();
        $training = $scheduleModel->countAllResults();
        //staff
        $assignmentModel = new assignmentModel();
        $staff = $assignmentModel->where('account_id<>',0)->countAllResults();
        //assignment
        $assignment = $this->db->table('assignments a')
                    ->select('c.batchName,b.name,b.details,b.day,b.from_time,b.to_time,a.schedule_id')
                    ->join('schedules b','b.schedule_id=a.schedule_id','LEFT')
                    ->join('batches c','c.batch_id=b.batch_id','LEFT')
                    ->where('a.account_id',session()->get('loggedAdmin'))
                    ->groupBy('a.assignment_id')
                    ->orderBy('a.assignment_id','DESC')->limit(5)
                    ->get()->getResult();

SELECT *
FROM `students`
WHERE `is_enroll` = 0
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `is_enroll` = 0
---
    public function registeredUser()
    {
        $studentModel = new studentModel();
        $searchTerm = $_GET['search']['value'] ?? '';
        if ($searchTerm) {
            $studentModel->like('school_id', $searchTerm)
                        ->orLike('lastname',$searchTerm)
                        ->orLike('middlename',$searchTerm)
                        ->orLike('firstname',$searchTerm);
        }
        $limit = $_GET['length'] ?? 10;
        $offset = $_GET['start'] ?? 0;
        $filteredStudentModel = clone $studentModel;
        if ($searchTerm) {
            $filteredStudentModel->like('school_id', $searchTerm)
                        ->orLike('lastname',$searchTerm)
                        ->orLike('middlename',$searchTerm)
                        ->orLike('firstname',$searchTerm);
        }
        $students = $studentModel->where('is_enroll',0)->findAll($limit, $offset);
        $totalRecords = $studentModel->where('is_enroll',0)->countAllResults();
        $filteredRecords = $filteredStudentModel->where('is_enroll',0)->countAllResults();

SELECT *
FROM `schedules`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `schedules`
---
    public function fetchPlans()
    {
        $scheduleModel = new scheduleModel();
        $searchTerm = $_GET['search']['value'] ?? '';
        if ($searchTerm) {
            $scheduleModel->like('name', $searchTerm)
                        ->orLike('school_year',$searchTerm);
        }
        $limit = $_GET['length'] ?? 10;
        $offset = $_GET['start'] ?? 0;
        $filteredScheduleModel = clone $scheduleModel;
        if ($searchTerm) {
            $filteredScheduleModel->like('name', $searchTerm)
                        ->orLike('school_year',$searchTerm);
        }
        $schedule = $scheduleModel->findAll($limit, $offset);
        $totalRecords = $scheduleModel->countAllResults();

SELECT `a`.`assignment_id`, `a`.`created_at`, `b`.`fullname`, `c`.`name`, `c`.`details`
FROM `assignments` `a`
INNER JOIN `accounts` `b` ON `b`.`account_id`=`a`.`account_id`
INNER JOIN `schedules` `c` ON `c`.`schedule_id`=`a`.`schedule_id`
GROUP BY `a`.`assignment_id`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `assignments`
---
    public function assignment()
    {
        $assignmentModel = new assignmentModel();
        $searchTerm = $_GET['search']['value'] ?? '';
        $start = intval($_GET['start'] ?? 0);      // Offset
        $length = intval($_GET['length'] ?? 10);   // Limit per page
        $builder = $this->db->table('assignments a');
        $builder->select('a.assignment_id,a.created_at,b.fullname,c.name,c.details');
        $builder->join('accounts b','b.account_id=a.account_id','INNER');
        $builder->join('schedules c','c.schedule_id=a.schedule_id','INNER');
        $builder->groupBy('a.assignment_id');
        if ($searchTerm) {
            // Add a LIKE condition to filter based on school name or address or any other column you wish to search
            $builder->groupStart()
                    ->like('b.fullname', $searchTerm)
                    ->orLike('c.name', $searchTerm)
                    ->groupEnd();
        }
        $builder->limit($length, $start);
        $assignment = $builder->get()->getResult();

        // Total number of filtered records (with search filter applied)
        $filteredRecords = count($assignment);

        $totalRecords = $assignmentModel->countAllResults();

SELECT *
FROM `schedules`
WHERE `schedule_id` = '1'
 LIMIT 1
SELECT *
FROM `accounts`
WHERE `account_id` = '2'
 LIMIT 1
SELECT `a`.`student_id`, `b`.`firstname`, `b`.`middlename`, `b`.`lastname`, `b`.`school_id`, `c`.`course`, `c`.`year`, `c`.`section`
FROM `trainings` `a`
LEFT JOIN `students` `b` ON `b`.`student_id`=`a`.`student_id`
LEFT JOIN `cadets` `c` ON `c`.`student_id`=`b`.`student_id`
WHERE `a`.`schedule_id` = '1'
GROUP BY `a`.`training_id`
---
    public function viewGradeBook($id)
    {
        if(!$this->hasPermission('grading_system'))
        {
            return redirect()->to('/dashboard')->with('fail', 'You do not have permission to access that page!');
        }
        else
        {
            $title = 'Gradebook';
            $pretitle="Gradebook";
            //schedule
            $scheduleModel = new scheduleModel();
            $schedule = $scheduleModel->where('schedule_id',$id)->first();
            if(empty($schedule))
            {
                return redirect()->to('/dashboard')->with('fail', 'No Record(s) found! Please try again');
            }
            //get the assign staff
            $model = new assignmentModel();
            $assignment = $model->where('schedule_id',$id)->first();
            $accountModel = new accountModel();
            $account = $accountModel->where('account_id',$assignment['account_id'])->first();
            //students
            $students = $this->db->table('trainings a')
                        ->select('a.student_id,b.firstname,b.middlename,b.lastname,b.school_id,c.course,c.year,c.section')
                        ->join('students b','b.student_id=a.student_id','LEFT')
                        ->join('cadets c','c.student_id=b.student_id','LEFT')
                        ->where('a.schedule_id',$id)
                        ->groupBy('a.training_id')
                        ->get()->getResult();

SELECT *
FROM `inventory`
LEFT JOIN `categories` ON `categories`.`category_id` = `inventory`.`category_id`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `inventory`
LEFT JOIN `categories` ON `categories`.`category_id` = `inventory`.`category_id`
SELECT COUNT(*) AS `numrows`
FROM `inventory`
---
                }
            }

            $data['inventory'] = $inventoryModel
                                ->join('categories', 'categories.category_id = inventory.category_id', 'LEFT')
                                ->paginate($perPage, 'default', $page);

            $data['total'] = $inventoryModel->countAllResults();

SELECT `a`.*, `b`.`item`
FROM `damaged_item` `a`
LEFT JOIN `inventory` `b` ON `b`.`inventory_id`=`a`.`inventory_id`
GROUP BY `a`.`damaged_id`
---
            $data['page']=$page;
            $data['perPage']=$perPage;
            //damaged Items
            $data['damage'] = $this->db->table('damaged_item a')
                                ->select('a.*,b.item')
                                ->join('inventory b','b.inventory_id=a.inventory_id','LEFT')
                                ->groupBy('a.damaged_id')->get()->getResult();

SELECT `a`.*, `b`.`item`
FROM `borrow_item` `a`
LEFT JOIN `inventory` `b` ON `b`.`inventory_id`=`a`.`inventory_id`
GROUP BY `a`.`borrow_id`
SELECT `a`.*, `b`.`lastname`, `b`.`firstname`, `b`.`middlename`
FROM `requests` `a`
LEFT JOIN `students` `b` ON `b`.`student_id`=`a`.`student_id`
GROUP BY `a`.`request_id`
---
    public function borrowInventory()
    {
        if(!$this->hasPermission('inventory'))
        {
            return redirect()->to('/dashboard')->with('fail', 'You do not have permission to access that page!');
        }
        else
        {
            $data['title']="Inventory";
            $data['pretitle'] = "Borrowed Items";
            //borrow Items
            $data['borrow'] = $this->db->table('borrow_item a')
                                ->select('a.*,b.item')
                                ->join('inventory b','b.inventory_id=a.inventory_id','LEFT')
                                ->groupBy('a.borrow_id')->get()->getResult();
            //purchase Items
            $data['request'] = $this->db->table('requests a')
                                ->select('a.*,b.lastname,b.firstname,b.middlename')
                                ->join('students b','b.student_id=a.student_id','LEFT')
                                ->groupBy('a.request_id')->get()->getResult();

SELECT `a`.`item`, `a`.`details`, `b`.`borrower`, `b`.`created_at`, `b`.`date_expected`, `c`.`created_at` as `date_return`, `c`.`status`
FROM `inventory` `a`
INNER JOIN `borrow_item` `b` ON `b`.`inventory_id`=`a`.`inventory_id`
LEFT JOIN `return_item` `c` ON `c`.`borrow_id`=`b`.`borrow_id`
GROUP BY `b`.`borrow_id`
---
    public function reportInventory()
    {
        if(!$this->hasPermission('inventory'))
        {
            return redirect()->to('/dashboard')->with('fail', 'You do not have permission to access that page!');
        }
        else
        {
            $data['title']="Inventory";
            $data['pretitle']="Inventory Report";
            //create query
            $data['report'] = $this->db->table('inventory a')
                                ->select('a.item,a.details,b.borrower,b.created_at,b.date_expected,c.created_at as date_return,c.status,c.remarks')
                                ->join('borrow_item b','b.inventory_id=a.inventory_id','INNER')
                                ->join('return_item c','c.borrow_id=b.borrow_id','LEFT')
                                ->groupBy('b.borrow_id')->get()->getResult();

SELECT *
FROM `announcement`
WHERE `announcement_id` = '3'
 LIMIT 1
---
    public function editAnnouncement($id)
    {
        if(!$this->hasPermission('announcement'))
        {
            return redirect()->to('/dashboard')->with('fail', 'You do not have permission to access that page!');
        }
        else
        {
            $title = 'Edit Announcement';
            $pretitle="Announcement";
            $data = ['title'=>$title,'pretitle'=>$pretitle];
            $announcementModel = new \App\Models\announcementModel();
            $announcement = $announcementModel->where('announcement_id',$id)->first();

SELECT `a`.*, `b`.`lastname`, `b`.`firstname`, `b`.`middlename`
FROM `reports` `a`
LEFT JOIN `students` `b` ON `b`.`student_id`=`a`.`student_id`
WHERE `type_report` = 'Violations'
AND `a`.`status` = 1
GROUP BY `a`.`report_id`
SELECT `a`.*, `b`.`lastname`, `b`.`firstname`, `b`.`middlename`
FROM `reports` `a`
LEFT JOIN `students` `b` ON `b`.`student_id`=`a`.`student_id`
WHERE `type_report` != 'Violations'
AND `a`.`status` = 1
GROUP BY `a`.`report_id`
---
    public function report()
    {
        if(!$this->hasPermission('report'))
        {
            return redirect()->to('/dashboard')->with('fail', 'You do not have permission to access that page!');
        }
        else
        {
            $title = 'Reports';
            $pretitle = "Reports";
            //violations
            $violation = $this->db->table('reports a')
                        ->select('a.*,b.lastname,b.firstname,b.middlename,c.fullname,d.fullname as user')
                        ->join('students b','b.student_id=a.student_id','LEFT')
                        ->join('accounts c','c.account_id=a.approver','LEFT')
                        ->join('accounts d','d.account_id=a.user','LEFT')
                        ->where('type_report','Violations')
                        ->where('a.status',1)
                        ->groupBy('a.report_id')
                        ->get()->getResult();
            //merits/demerits
            $others = $this->db->table('reports a')
                        ->select('a.*,b.lastname,b.firstname,b.middlename,c.fullname,d.fullname as user')
                        ->join('students b','b.student_id=a.student_id','LEFT')
                        ->join('accounts c','c.account_id=a.approver','LEFT')
                        ->join('accounts d','d.account_id=a.user','LEFT')
                        ->where('type_report !=','Violations')
                        ->where('a.status',1)
                        ->groupBy('a.report_id')
                        ->get()->getResult();

SELECT `a`.*, `b`.`lastname`, `b`.`firstname`, `b`.`middlename`
FROM `reports` `a`
LEFT JOIN `students` `b` ON `b`.`student_id`=`a`.`student_id`
GROUP BY `a`.`report_id`
---
    public function allMerits()
    {
        if(!$this->hasPermission('report'))
        {
            return redirect()->to('/dashboard')->with('fail', 'You do not have permission to access that page!');
        }
        else
        {
            $title = 'Merits/Demerits';
            $pretitle = "All Records";
            //merits/demerits
            $others = $this->db->table('reports a')
                        ->select('a.*,b.lastname,b.firstname,b.middlename')
                        ->join('students b','b.student_id=a.student_id','LEFT')
                        ->groupBy('a.report_id')
                        ->get()->getResult();

SELECT `a`.*, `b`.`lastname`, `b`.`firstname`, `b`.`middlename`
FROM `reports` `a`
LEFT JOIN `students` `b` ON `b`.`student_id`=`a`.`student_id`
WHERE `a`.`status` = 0
GROUP BY `a`.`report_id`
---
    public function forReview()
    {
        if(!$this->hasPermission('report'))
        {
            return redirect()->to('/dashboard')->with('fail', 'You do not have permission to access that page!');
        }
        else
        {
            $title = 'Merits/Demerits';
            $pretitle = "For Review";
            //merits/demerits
            $records = $this->db->table('reports a')
                        ->select('a.*,b.lastname,b.firstname,b.middlename')
                        ->join('students b','b.student_id=a.student_id','LEFT')
                        ->where('a.status',0)
                        ->groupBy('a.report_id')
                        ->get()->getResult();