app/Controllers/Administrator.php

SELECT *
FROM `accounts`
WHERE `status` = 1
---
    public function createBatch()
    {
        if(!$this->hasPermission('grading_system'))
        {
            return redirect()->to('/dashboard/batch')->with('fail', 'You do not have permission to access that page!');
        }
        else
        {
            $data['title']="Gradebook";
            $accountModel = new accountModel();
            $data['account'] = $accountModel->where('status',1)->findAll();

SELECT *
FROM `inventory`
LEFT JOIN `categories` ON `categories`.`category_id`=`inventory`.`category_id`
SELECT `a`.*, `b`.`item`
FROM `damaged_item` `a`
LEFT JOIN `inventory` `b` ON `b`.`inventory_id`=`a`.`inventory_id`
GROUP BY `a`.`damaged_id`
SELECT `a`.*, `b`.`item`
FROM `borrow_item` `a`
LEFT JOIN `inventory` `b` ON `b`.`inventory_id`=`a`.`inventory_id`
GROUP BY `a`.`borrow_id`
SELECT `a`.*, `b`.`item`
FROM `return_item` `a`
LEFT JOIN `inventory` `b` ON `b`.`inventory_id`=`a`.`inventory_id`
GROUP BY `a`.`return_id`
SELECT `a`.*, `b`.`lastname`, `b`.`firstname`, `b`.`middlename`
FROM `requests` `a`
LEFT JOIN `students` `b` ON `b`.`student_id`=`a`.`student_id`
GROUP BY `a`.`request_id`
---
    public function inventory()
    {
        if(!$this->hasPermission('inventory'))
        {
            return redirect()->to('/dashboard')->with('fail', 'You do not have permission to access that page!');
        }
        else
        {
            $data['title']="Inventory";
            //load all the items
            $inventoryModel = new inventoryModel();
            $data['inventory'] = $inventoryModel->join('categories','categories.category_id=inventory.category_id','LEFT')
                                                ->findAll();
            //damaged Items
            $data['damage'] = $this->db->table('damaged_item a')
                                ->select('a.*,b.item')
                                ->join('inventory b','b.inventory_id=a.inventory_id','LEFT')
                                ->groupBy('a.damaged_id')->get()->getResult();
            //damaged Items
            $data['borrow'] = $this->db->table('borrow_item a')
                                ->select('a.*,b.item')
                                ->join('inventory b','b.inventory_id=a.inventory_id','LEFT')
                                ->groupBy('a.borrow_id')->get()->getResult();
            //return Items
            $data['return'] = $this->db->table('return_item a')
                                ->select('a.*,b.item')
                                ->join('inventory b','b.inventory_id=a.inventory_id','LEFT')
                                ->groupBy('a.return_id')->get()->getResult();
            //purchase Items
            $data['request'] = $this->db->table('requests a')
                                ->select('a.*,b.lastname,b.firstname,b.middlename')
                                ->join('students b','b.student_id=a.student_id','LEFT')
                                ->groupBy('a.request_id')->get()->getResult();