app/Controllers/Export.php

SELECT `a`.*, `b`.`lastname`, `b`.`firstname`, `b`.`middlename`, `c`.`fullname`, `d`.`fullname` as `user`
FROM `reports` `a`
LEFT JOIN `students` `b` ON `b`.`student_id`=`a`.`student_id`
LEFT JOIN `accounts` `c` ON `c`.`account_id`=`a`.`approver`
LEFT JOIN `accounts` `d` ON `d`.`account_id`=`a`.`user`
WHERE `type_report` != 'Violations'
AND `a`.`status` = 1
GROUP BY `a`.`report_id`
---
    public function exportMeritsDemerits()
    {
        $result = $this->db->table('reports a')
                ->select('a.*,b.lastname,b.firstname,b.middlename,c.fullname,d.fullname as user')
                ->join('students b','b.student_id=a.student_id','LEFT')
                ->join('accounts c','c.account_id=a.approver','LEFT')
                ->join('accounts d','d.account_id=a.user','LEFT')
                ->where('type_report !=','Violations')
                ->where('a.status',1)
                ->groupBy('a.report_id')
                ->get()->getResult();