app/Controllers/Home.php

SELECT *
FROM `cadets`
WHERE `student_id` = '1'
 LIMIT 1
---
    public function studentDashboard()
    {
        $session = session();
        if($session->get('loggedUser') == null)
        {
            return redirect()->to(base_url('/'));
        }
        else
        {
            //check if cadets is empty
            $cadetModel = new cadetModel();
            $cadet = $cadetModel->where('student_id',session()->get('loggedUser'))->first();

SELECT *
FROM `qrcodes`
WHERE `student_id` = '1'
 LIMIT 1
SELECT *
FROM `students`
WHERE `student_id` = '1'
 LIMIT 1
---
    public function qrCode()
    {
        $data['title'] = "My QR Code";
        //check if cadets is empty
        $studentModel = new \App\Models\studentModel();
        $qrcodeModel = new qrcodeModel();
        $qrcode = $qrcodeModel->where('student_id',session()->get('loggedUser'))->first();
        $student = $studentModel->where('student_id',session()->get('loggedUser'))->first();

SELECT *
FROM `attachments`
WHERE `student_id` = '1'
 LIMIT 1
---
    public function upload()
    {
        $data['title']="Upload File";
        $attachmentModel = new \App\Models\attachmentModel();
        $data['attachment'] = $attachmentModel->where('student_id',session()->get('loggedUser'))->first();