app/Controllers/Inventory.php

    public function damageItem()
    {
        $model = new inventoryModel();
        $damage = new damageModel();
        $validation = $this->validate([
            'quantity'=>'required|numeric',
            'reason'=>'required'
        ]);
        if(!$validation)
        {
            return $this->response->setJSON(['errors'=>$this->validator->getErrors()]);
        }
        else
        {
            $data = [
                    'inventory_id'=>$this->request->getPost('damageID'),
                    'qty'=>$this->request->getPost('quantity'),
                    'reason'=>$this->request->getPost('reason'),
                    'status'=>0
                ];
            $damage->save($data);
            //deduct the items
            $inventory = $model->where('inventory_id',$this->request->getPost('damageID'))->first();
            $oldQty = $inventory['quantity'];
            $newQty = $oldQty-$this->request->getPost('quantity');
            $records = ['quantity'=>$newQty];
            $model->update($this->request->getPost('damageID'),$records);
            //logs
            date_default_timezone_set('Asia/Manila');
            $logModel = new \App\Models\logModel();
            $data = ['account_id'=>session()->get('loggedAdmin'),
                    'activities'=>'Tag item as damaged. Qty :'.$this->request->getPost('quantity'),
                    'page'=>'Inventory',
                    'datetime'=>date('Y-m-d h:i:s a')
                    ];
---
UPDATE `inventory` SET `quantity` = 8, `updated_at` = '2025-11-18 06:07:33'
WHERE `inventory`.`inventory_id` IN ('1')
SELECT *
FROM `inventory`
WHERE `inventory_id` = '1'
 LIMIT 1